/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "Handlingen kunne ikke fullføres";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Det oppsto en ukjent feil (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Kan ikke fullføre handlingen";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Prøv igjen senere.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Kan ikke ta opp";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Ta opp på nytt.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Kan ikke ta opp";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Stopp andre handlinger som bruker %@, og prøv igjen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Kan ikke ta opp";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Ta opp på nytt.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Ta opp på nytt.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operasjonen stoppet";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Det er ikke nok ledig plass til å fortsette filskrivingen. Frigjør plass ved å slette eksisterende videoer eller bilder.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Ta opp på nytt.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Ta opp på nytt.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "Maksimumslengden for dette opptaket er nådd."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "Maksimumsstørrelsen for dette opptaket er nådd."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Stopp andre handlinger som bruker opptaksenheten, og prøv igjen.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "Maksimumslengden for dette opptaket er nådd."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Kan ikke ta opp";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Ta opp på nytt.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Kan ikke bruke %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Stopp andre handlinger som bruker %@, og prøv igjen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Kan ikke bruke %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Stopp andre handlinger som bruker %@, og prøv igjen."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "Opptaket stoppet";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Stopp andre handlinger som bruker opptaksenheten, og prøv igjen.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Kan ikke fullføre handlingen";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Prøv igjen senere.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Kan ikke fullføre eksporteringen";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Prøv å eksportere på nytt.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Kan ikke dekode";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Mediedataene kunne ikke dekodes. De er kanskje skadet.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Dette medieformatet støttes ikke.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Kan ikke arkivere";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Prøv å arkivere på nytt.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Mediet kan ikke brukes.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Mediet kan ikke brukes.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Mediet kan ikke brukes.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Mediet kan ikke brukes.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Dette medieformatet støttes ikke.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Mediet er kanskje skadet.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Kan ikke ta bilde";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Prøv å ta et bilde på nytt.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operasjonen stoppet";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "Operasjonen støttes ikke for beskyttet innhold."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Innholdet er ikke autorisert."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Programmet er ikke autorisert til å spille av denne filen."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Mediet kan ikke brukes.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Kan ikke dekode";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "Den nødvendige dekoderen for mediet ble ikke funnet.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Kan ikke kode";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "Den nødvendige koderen for mediet ble ikke funnet.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Kan ikke dekode";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "Den nødvendige dekoderen for mediet er opptatt.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Stopp andre handlinger som dekoder medier, og prøv igjen.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Kan ikke kode";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "Den nødvendige koderen for mediet er opptatt.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Stopp andre handlinger som koder medier, og prøv igjen.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Kan ikke bruke %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "%@ kan ikke brukes av et program som kjører i bakgrunnen."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operasjonen stoppet";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "Operasjonen støttes ikke for dette mediet.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operasjonen stoppet";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "Videoen kunne ikke settes sammen i henhold til instruksjonene.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Kan ikke åpne";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Mediet kan ikke brukes.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operasjonen stoppet";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "Bufferfilen på URL-måladressen for nedlastingen kan ikke brukes.";
